In [3]:
#!pip3 install pandas

Collecting pandas
  Downloading pandas-1.4.2-cp310-cp310-macosx_10_9_x86_64.whl (11.1 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 11.1/11.1 MB 62.9 MB/s eta 0:00:0000:010:01
Requirement already satisfied: python-dateutil>=2.8.1 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from pandas) (2022.1)
Collecting numpy>=1.21.0
  Downloading numpy-1.22.3-cp310-cp310-macosx_10_14_x86_64.whl (17.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 17.6/17.6 MB 61.5 MB/s eta 0:00:0000:0100:01
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: numpy, pandas
Successfully installed numpy-1.22.3 pandas-1.4.2

In [3]:
import pandas as pd

Create a dictionary which you can convert to a dataframe

In [6]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 3, 7, 2]
}

In [5]:
purchases = pd.DataFrame(data)

purchases


#in R, this would be
# data = as.dataframe(apples = c(3, 2, 0, 1),
#                     oranges = c(0, 3, 7, 2))

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

You can add index, or row names:

In [8]:
purchases = pd.DataFrame(data, index=['June', 'Robert', 'Lily', 'David'])

purchases

# in R:
# rownames(purchases) = c('June', 'Robert', 'Lily', 'David')

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

you can look at rows by index names

In [9]:
purchases.loc['June']

# in R: purchases[which(rownames(purchases) == "June", ]

apples     3
oranges    0
Name: June, dtype: int64

You can also read data from a .csv file

In [13]:
df = pd.read_csv('data/purchases.csv')

df

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

In [16]:
#take first column as index
df = pd.read_csv('data/purchases.csv', index_col=0)

df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [ ]:
#pandas can also read json files
df = pd.read_json('purchases.json')

df